In [1]:
import pandas as pd
from datetime import datetime
import numpy as np
from itertools import dropwhile

In [2]:

df = pd.DataFrame([[10  ,      "Mumbai"   ,  '2015-12-11'  ]   ,               
   [1 ,       "Bangalore" , '2016-01-15'],
   [12    ,    "Pune"    ,   '2016-01-26'],
   [4    ,    "Mumbai"  ,    np.nan],
   [15   ,     "Delhi" ,     '2016-04-29'],
   [6   ,     "Mumbai"   ,    np.nan],
   [14    ,    "Bangalore" ,   np.nan],
  [ 5   ,     "Pune"    ,   '2016-05-25'],
   [8   ,     "Mumbai"  ,   '2016-12-13']], columns = ['value', 'city', 'date'])

In [3]:
df

   value       city        date
0     10     Mumbai  2015-12-11
1      1  Bangalore  2016-01-15
2     12       Pune  2016-01-26
3      4     Mumbai         NaN
4     15      Delhi  2016-04-29
5      6     Mumbai         NaN
6     14  Bangalore         NaN
7      5       Pune  2016-05-25
8      8     Mumbai  2016-12-13

In [4]:
from tsa.interpolation import impute_time_axis as impute

In [5]:
df['date'] = impute(df['date'])

In [6]:
df

   value       city       date
0     10     Mumbai 2015-12-11
1      1  Bangalore 2016-01-15
2     12       Pune 2016-01-26
3      4     Mumbai 2016-03-13
4     15      Delhi 2016-04-29
5      6     Mumbai 2016-05-07
6     14  Bangalore 2016-05-16
7      5       Pune 2016-05-25
8      8     Mumbai 2016-12-13